Revit 2027 API
BuiltInFailures.BendFailures.DeleteSegmentInBankNotAllowed Property
 Delete a segment in a bank is not allowed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteSegmentInBankNotAllowed { get; }
Public Shared ReadOnly Property DeleteSegmentInBankNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteSegmentInBankNotAllowed {
	FailureDefinitionId^ get ();
}
static member DeleteSegmentInBankNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace